# -------------------------------------------------------------------------------------------
# 라이브러리 선언
import pprint
from influxdb import InfluxDBClient
# -------------------------------------------------------------------------------------------


# -------------------------------------------------------------------------------------------
# influxdb 클라이언트 생성 함수
def get_ifdb(db, host='180.70.53.4', port=11334, user='root', passwd='root'):
    # client 객체 생성, 해당 객체는 influxdb에 연결하기 위한 정보를 포함함
    client = InfluxDBClient(host, port, user, passwd, db)

    try:
        # db 기반의 클라이언트 생성
        client.create_database(db)
        print('success')
    except:
        print('failed')
        pass
    return client
# -------------------------------------------------------------------------------------------


# -------------------------------------------------------------------------------------------
# 아두이노에서 받은 데이터를 influxdb 클라이언트에 저장
def my_test(ifdb):
    tablename = 'my_table'
    # influxdb데이터를 불러와 터미널에 출력
    result = ifdb.query('select * from %s' % tablename)
    pprint.pprint(result.raw)
# -------------------------------------------------------------------------------------------


# -------------------------------------------------------------------------------------------
# 메인 함수
def do_test():
    mydb = get_ifdb(db='test1')
    # 해당 클라이언트로 작업(my_test) 수행
    my_test(mydb)
# -------------------------------------------------------------------------------------------


# -------------------------------------------------------------------------------------------
# 시작함수
if __name__ == '__main__':
    do_test()
# -------------------------------------------------------------------------------------------
